* Org Babel Translate

Translate text in Emacs' org-mode blocks, like so:

#+BEGIN_EXAMPLE
#+BEGIN_SRC translate :src en :dest de
This is a test.
#+END_SRC

#+RESULTS:
: Dies ist ein Test .
#+END_EXAMPLE

Or with multiple destination languages:

#+BEGIN_EXAMPLE
#+BEGIN_SRC translate :src en :dest de,fr,ar,ja
This is a test.
#+END_SRC

#+RESULTS:
| de | Dies ist ein Test . |
| fr | Ceci est un essai . |
| ar | هذا هو الاختبار.    |
| ja | これはテストです。  |
#+END_EXAMPLE

When the text is long lines, will show result in example block:

#+begin_src translate :src en :dest de,fr,ar,ja
When you're a kid, you can smile a lot, but when you grow, when you know a lot,
you find that world is just mess.
#+end_src

#+RESULTS[(2020-06-01 14:14:03) bc13a0207523f2b0cbe83bc63551b5a11d0300ae]:
#+begin_example
language: [de]

Wenn Sie ein Kind sind, können Sie viel lächeln, aber wenn Sie wachsen, wenn Sie
viel wissen, finden Sie, dass Welt nur Chaos.

language: [fr]

Quand vous êtes un enfant, vous pouvez sourire beaucoup, mais quand tu seras
grand, quand vous savez beaucoup, vous trouverez ce monde est juste gâchis.

language: [ar]

عندما كنت طفلا، يمكن أن تبتسم كثيرا، ولكن عندما تكبر، وعندما تعرف الكثير، تجد أن
العالم هو الفوضى عادل.

language: [ja]

あなたは子供ができたら、あなたは多くのことを知っているとき、あなたは世界はただ混
乱であることがわかり、あなたは多くのことを笑顔することができますが、大きくなった
ら。
#+end_example

** Installation

If you're hooked up to [[http://melpa.milkbox.net/][MELPA]]:

#+BEGIN_EXAMPLE
M-x package-refresh-contents
M-x package-install RET ob-translate
#+END_EXAMPLE

Alternatively just grab the single =ob-translate.el= file and install that in your preferred way.

** Status

Beta. It works for me, but I'll bet there are some character encoding
issues in there for some languages. Please file an issue if you spot a
problem.

** Options

Each block supports the following arguments:

| Argument | Description              | Example                           | Default                      |
|----------+--------------------------+-----------------------------------+------------------------------|
| =:src=     | Source language.         | =#+BEGIN_SRC translate :src de=     | 'auto' (for auto detection). |
| =:dest=    | Destination language(s). | =#+BEGIN_SRC translate :dest it,fr= | 'en' (for English).          |

=:dest= may be a single country-code, or a comma-separated list.

All defaults are customizable with =M-x customize-group RET ob-translate=.
